Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.1.27/samda1/svd/ATSAMDA1E15A.svd
                  <register>
                     <name>EPINTENCLR</name>
                     <description>DEVICE_ENDPOINT End Point Interrupt Clear Flag</description>
                     <addressOffset>0x8</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Disable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Disable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL0</name>
                           <description>Error Flow 0 Interrupt Disable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL1</name>
                           <description>Error Flow 1 Interrupt Disable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>RXSTP</name>
                           <description>Received Setup Interrupt Disable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL0</name>
                           <description>Stall 0 In/Out Interrupt Disable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL1</name>
                           <description>Stall 1 In/Out Interrupt Disable</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPINTENSET</name>
                     <description>DEVICE_ENDPOINT End Point Interrupt Set Flag</description>
                     <addressOffset>0x9</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Enable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Enable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL0</name>
                           <description>Error Flow 0 Interrupt Enable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL1</name>
                           <description>Error Flow 1 Interrupt Enable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>RXSTP</name>
                           <description>Received Setup Interrupt Enable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL0</name>
                           <description>Stall 0 In/out Interrupt enable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL1</name>
                           <description>Stall 1 In/out Interrupt enable</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
               </cluster>
            </cluster>
            <cluster>
               <name>HOST</name>
               <description>USB is Host</description>
               <alternateCluster>DEVICE</alternateCluster>
               <headerStructName>UsbHost</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>DEVICE</name>
                              <description>Device Mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HOST</name>
                              <description>Host Mode</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>QOSCTRL</name>
                  <description>USB Quality Of Service</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x05</resetValue>
                  <fields>
                     <field>
                        <name>CQOS</name>
                        <description>Configuration Quality of Service</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CQOSSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Background (no sensitive operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Sensitive Bandwidth</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUM</name>
                              <description>Sensitive Latency</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Critical Latency</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DQOS</name>
                        <description>Data Quality of Service</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DQOSSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Background (no sensitive operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Sensitive Bandwidth</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUM</name>
                              <description>Sensitive Latency</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Critical Latency</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>HOST Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>RESUME</name>
                        <description>Send USB Resume</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPDCONF</name>
                        <description>Speed Configuration for Host</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPDCONFSelect</name>
                           <enumeratedValue>
                              <name>NORMAL</name>
                              <description>Normal mode: the host starts in full-speed mode and performs a high-speed reset to switch to the high speed mode if the downstream peripheral is high-speed capable.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>Full-speed: the host remains in full-speed mode whatever is the peripheral speed capability. Relevant in UTMI mode only.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TSTJ</name>
                        <description>Test mode J</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTK</name>
                        <description>Test mode K</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFE</name>
                        <description>Start of Frame Generation Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSRESET</name>
                        <description>Send USB Reset</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSOK</name>
                        <description>VBUS is OK</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>L1RESUME</name>
                        <description>Send L1 Resume</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSOFC</name>
                  <description>HOST Host Start Of Frame Control</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLENC</name>
                        <description>Frame Length Control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>FLENCE</name>
                        <description>Frame Length Control Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>HOST Status</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Speed Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LINESTATE</name>
                        <description>USB Line State Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSMSTATUS</name>
                  <description>Finite State Machine Status</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>FSMSTATE</name>
                        <description>Fine State Machine Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>FSMSTATESelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ON</name>
                              <description>ON (L0). It corresponds to the Idle and Active states</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>SUSPEND (L2)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLEEP</name>
                              <description>SLEEP (L1)</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DNRESUME</name>
                              <description>DNRESUME. Down Stream Resume.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPRESUME</name>
                              <description>UPRESUME. Up Stream Resume.</description>
                              <value>0x20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESET</name>
                              <description>RESET. USB lines Reset.</description>
                              <value>0x40</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FNUM</name>
                  <description>HOST Host Frame Number</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>MFNUM</name>
                        <description>Micro Frame Number</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FLENHIGH</name>
                  <description>HOST Host Frame Length</description>
                  <addressOffset>0x12</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLENHIGH</name>
                        <description>Frame Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>HOST Host Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSOF</name>
                        <description>Host Start Of Frame Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RST</name>
                        <description>BUS Reset Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up Interrupt Disable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DNRSM</name>
                        <description>DownStream to Device Interrupt Disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume from Device Interrupt Disable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DCONN</name>
                        <description>Device Connection Interrupt Disable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DDISC</name>
                        <description>Device Disconnection Interrupt Disable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
